#pragma once






























//버블소트

//알고리즘 연습방법
// 잘 작성된 알고리즘을 이해하고, 스스로 만들어봐야한다.
// 알고리즘 연습방법


// 연습장과 펜을 준비하자
// 알고리즘 문제를 읽고 분석한 후에
// 간단하게 테스트용으로 매우 간단한 경우부터 복잡한 경우 순서대로 생각해보면서
// 연습장과 펜을 이용하여 알고리즘을 생각해본다.
// 가능한 알고리즘이 보인다면, 구현할 알고리즘을 세부 항목으로 나누고
//문장으로 세부 항목을 나누어서 적어본다.
//코드화하기 위해, 데이터 구조 또는 사용할 변수를 정리하고
// 각 문장을 코드레벨로 적는다.
// 데이터 구조  또는 사용할 변수가 코드에 따라 어떻게 변하는지 손으로 적으면서 임의 데이터로 코드가
// 정상 작동하는지를 연습장과 펜으로 검증한다.

// 종이와 펜이 중요, 다양한 경우의 알고리즘들을 많이 보아야한다.


// 잘 작성된 알고리즘을 처음에 잘 이해하고, 스스로 잘 만들수 있어야 한다.
// 모방은 창조의 어머니


//정렬이란?

// 어떤 데이터들이 주어졌을 때. 이를 정해진 순서대로 나열하는 것
// 정렬은 프로그램 작성시 빈번하게 필요로 함.
// 다양한 알고리즘이 고안되었으며, 알고리즘 학습의 필수

//다양한 정렬 알고리즘의 이해를 통해, 동일한 문제에 대해 다양한 알고리즘이 고안될 수 있음을 이해하고
// 각 알고리즘 간 성능 분석에 대해서도 이해할 수 있음

//버블정렬

//두 인접한 데이터를 비교해서 앞에 있는 데이터가 뒤에 있는 데이터보다 크면 자리를 바꾸는 알고리즘
